#include "pause_world_map.h"
#include "code_0801DA58.h"
#include "constants/pause_menu.h"
#include "functions.h"
#include "kirby.h"
#include "palette.h"
#include "pause_area_map.h"
#include "pause_fade.h"
#include "pause_help.h"
#include "save.h"
#include "subgames.h"

struct PACKED ALIGNED(2) CoorU8 {
    /* 0x00 */ u8 x;
    /* 0x01 */ u8 y;
}; /* size = 0x2 */

struct WorldMapKirbysCoorByRoom {
    /* 0x00 */ u32 roomId;
    /* 0x04 */ struct CoorU8 kirbyCoor[4];
}; /* size = 0xC */

struct WorldMapLineCoor {
    /* 0x0 */ u8 unlockedDoorX;
    /* 0x1 */ u8 unlockedDoorY;
    /* 0x2 */ u8 destX;
    /* 0x3 */ u8 destY;
}; /* size = 0x4 */

enum WorldMapDoorAnimInfosIndex {
    VISITED_CENTRAL_HALL,
    REACHED_CENTRAL_HALL,
    BLINKING_CENTRAL_HALL,
    VISITED_DOOR,
    UNVISITED_DOOR,
    REACHED_DOOR,   // Line has been drawn and reached dest
    BLINKING_DOOR,  // Line is being drawn and hasn't yet reached dest
    DOT,
    NUM_DOOR_ANIM_INFOS
};

static void WorldMapLineDrawn(void);
static void WorldMapPauseInit(void);
static void WorldMapPauseMain(void);
static void WorldMapUnlockInitBg(void);
static void WorldMapUnlockInitKirbyAndDoors(void);
static void WorldMapUnlockWaitLineFinish(void);
static void WorldMapUnlockMain(void);
static void WorldMapToNextMenu(void);
static void WorldMapSetTileDoorVisited(enum WorldMapDoor);
static void WorldMapSetTileDoorUnvisited(enum WorldMapDoor);
static void WorldMapToGame(void);

extern const u16 gWorldMapBgPalette[0x80];

extern const struct WorldMapKirbysCoorByRoom* const gWorldMapKirbysCoorsByArea[NUM_AREA_IDS];
extern const struct WorldMapDotCoor* const gWorldMapDotCoors[NUM_WORLDMAP_DOORS];

// Used with gLanguages as index, so range 0x00-0x47 is useful
// What about 0x48-0x5C?
extern const struct AnimInfo gUnk_08358D94[][3];

extern const struct AnimInfo gWorldMapDoorAnimInfos[NUM_DOOR_ANIM_INFOS];
extern const u16 gWorldMapDoorRoomIds[NUM_WORLDMAP_DOORS];
extern const u16 gWorldMapDoorTilemapOffsets[NUM_WORLDMAP_DOORS];
extern const struct WorldMapLineCoor gWorldMapLineCoors[NUM_WORLDMAP_DOORS];
extern const u8 gWorldMapDoorDotCounts[NUM_WORLDMAP_DOORS];

extern const u8 gWorldMapDoorNumDots[NUM_WORLDMAP_DOORS];

struct WorldMapDot {
    /* 0x00 */ u16 tilemapIndex;
    /* 0x02 */ u16 length;  // in halfwords
}; /* size = 0x4 */
extern const struct WorldMapDot gWorldMapDotsMoonlightMansion[];
extern const struct WorldMapDot gWorldMapDotsRainbowRouteEast[];
extern const struct WorldMapDot gWorldMapDotsRainbowRouteSouth[];
extern const struct WorldMapDot gWorldMapDotsCabbageCavernCenter[];
extern const struct WorldMapDot gWorldMapDotsRainbowRouteWest[];
extern const struct WorldMapDot gWorldMapDotsCarrotCastle[];
extern const struct WorldMapDot gWorldMapDotsRainbowRouteNorth[];
extern const struct WorldMapDot gWorldMapDotsMustardMountain[];
extern const struct WorldMapDot gWorldMapDotsCabbageCavernWest[];
extern const struct WorldMapDot gWorldMapDotsRadishRuins[];
extern const struct WorldMapDot gWorldMapDotsPeppermintPalaceEast[];
extern const struct WorldMapDot gWorldMapDotsPeppermintPalaceWest[];
extern const struct WorldMapDot gWorldMapDotsCabbageCavernEast[];
extern const struct WorldMapDot gWorldMapDotsOliveOcean[];
