#include "pause_world_map.h"
#include "code_0801DA58.h"
#include "constants/languages.h"
#include "functions.h"
#include "kirby.h"
#include "palette.h"
#include "pause_area_map.h"
#include "pause_fade.h"
#include "pause_help.h"
#include "save.h"
#include "subgames.h"

enum WorldMapDoorAnimInfosIndex {
    VISITED_CENTRAL_HALL,
    REACHED_CENTRAL_HALL,
    BLINKING_CENTRAL_HALL,
    VISITED_DOOR,
    UNVISITED_DOOR,
    REACHED_DOOR,   // Line has been drawn and reached dest
    BLINKING_DOOR,  // Line is being drawn and hasn't yet reached dest
    DOT,
    NUM_DOOR_ANIM_INFOS
};

enum WorldMapLineFlags {
    LINE_FLAG_CENTRAL_HALL_IS_DEST = 0x01,
    LINE_FLAG_LINE_DRAW_COMPLETED = 0x02
};

enum WorldMapKirbyDrawFlags {
    WORLDMAP_KIRBY_DRAW_NO_SPRITE = 0x0001,
    WORLDMAP_KIRBY_DRAW_NO_ACCESSORY = 0x0002
};

enum WorldMapDoorNumDots {
    DOOR_NUM_DOTS_NO_UNLOCK = 0,
    DOOR_NUM_DOTS_MOONLIGHT_MANSION = 1,
    DOOR_NUM_DOTS_RAINBOW_ROUTE_EAST = 2,
    DOOR_NUM_DOTS_RAINBOW_ROUTE_SOUTH = 2,
    DOOR_NUM_DOTS_CABBAGE_CAVERN_CENTER = 2,
    DOOR_NUM_DOTS_RAINBOW_ROUTE_WEST = 1,
    DOOR_NUM_DOTS_CARROT_CASTLE = 2,
    DOOR_NUM_DOTS_RAINBOW_ROUTE_NORTH = 3,
    DOOR_NUM_DOTS_MUSTARD_MOUNTAIN = 2,
    DOOR_NUM_DOTS_CABBAGE_CAVERN_WEST = 3,
    DOOR_NUM_DOTS_RADISH_RUINS = 2,
    DOOR_NUM_DOTS_PEPPERMINT_PALACE_EAST = 2,
    DOOR_NUM_DOTS_PEPPERMINT_PALACE_WEST = 4,
    DOOR_NUM_DOTS_CABBAGE_CAVERN_EAST = 4,
    DOOR_NUM_DOTS_OLIVE_OCEAN = 3,
    DOOR_NUM_DOTS_CANDY_CONSTELLATION = 6,
};

enum WorldMapDotDoorCounts {
    DOOR_DOT_COUNT_NO_UNLOCK = 0,
    DOOR_DOT_COUNT_MOONLIGHT_MANSION = 4,
    DOOR_DOT_COUNT_RAINBOW_ROUTE_EAST = 6,
    DOOR_DOT_COUNT_RAINBOW_ROUTE_SOUTH = 3,
    DOOR_DOT_COUNT_CABBAGE_CAVERN_CENTER = 4,
    DOOR_DOT_COUNT_RAINBOW_ROUTE_WEST = 3,
    DOOR_DOT_COUNT_CARROT_CASTLE = 3,
    DOOR_DOT_COUNT_RAINBOW_ROUTE_NORTH = 4,
    DOOR_DOT_COUNT_MUSTARD_MOUNTAIN = 4,
    DOOR_DOT_COUNT_CABBAGE_CAVERN_WEST = 6,
    DOOR_DOT_COUNT_RADISH_RUINS = 4,
    DOOR_DOT_COUNT_PEPPERMINT_PALACE_EAST = 4,
    DOOR_DOT_COUNT_PEPPERMINT_PALACE_WEST = 9,
    DOOR_DOT_COUNT_CABBAGE_CAVERN_EAST = 8,
    DOOR_DOT_COUNT_OLIVE_OCEAN = 6,
    DOOR_DOT_COUNT_CANDY_CONSTELLATION = 12,
};

/*
 * Used to terminate arrays of `WorldMapKirbysCoorByRoom` by setting this for `WorldMapKirbysCoorByRoom::roomId`.
 */
#define KIRBYS_COORS_TERMINATE 0

struct PACKED KirbyCoor {
    /* 0x00 */ u8 x;
    /* 0x01 */ u8 y;
}; /* size = 0x2 */

struct WorldMapKirbysCoorByRoom {
    /* 0x00 */ u32 roomId;
    /* 0x04 */ struct KirbyCoor kirbyCoor[4];
}; /* size = 0xC */

struct WorldMapLineCoor {
    /* 0x00 */ u8 unlockedDoorX;
    /* 0x01 */ u8 unlockedDoorY;
    /* 0x02 */ u8 destX;
    /* 0x03 */ u8 destY;
}; /* size = 0x4 */

struct WorldMapDotCoor {
    /* 0x00 */ u8 x;
    /* 0x01 */ u8 y;
}; /* size = 0x4 */

struct WorldMapLine {
    /* 0x00 */ struct Sprite unlockedDoor;
    /* 0x28 */ struct Sprite dest;
    /* 0x50 */ struct Sprite dot;
    /* 0x78 */ const struct WorldMapDotCoor* dotCoors;
    /* 0x7C */ s8 unlockedDoorId;
    /* 0x7D */ s8 dotCounter;
    /* 0x7E */ u8 frameCounter;
    /* 0x7F */ u8 flags;  // According to enum WorldMapLineFlags
}; /* size = 0x80 */

struct WorldMapKirby {
    /* 0x00 */ struct Sprite kirby;
    /* 0x28 */ struct Sprite abilityAccessory;
    /* 0x50 */ u16 flags;  // According to enum WorldMapKirbyDrawFlags
}; /* size = 0x54 */

struct WorldMap {
    /* 0x000 */ struct Background bg;
    /* 0x040 */ struct WorldMapKirby worldmapKirbys[4];
    /* 0x190 */ u8 filler190[0x78];
    /* 0x208 */ u16 unk208;
    /* 0x20A */ u16 unk20A;
    /* 0x20C */ s8 unlockedDoorId;  // According to enum WorldMapDoor
    /* 0x20E */ s16 unlockCounter;
    /* 0x210 */ u8 nextMenuId;  // According to enum PauseMenuId
    /* 0x211 */ s8 closeCounter;
    /* 0x214 */ struct Task* worldmapLineTask;
}; /* size = 0x218 */

/*
 * Contiguous line segment tiles in the tilemap.
 * The number of line segments to each door is documented in `sWorldMapDoorNumLineEntries`.
 */
struct WorldMapLineEntries {
    /* 0x00 */ u16 tilemapIndex;
    /* 0x02 */ u16 length;  // in halfwords
}; /* size = 0x4 */

static const struct AnimInfo sUnk_08358D94[NUM_LANGUAGES][3] = {
    [LANGUAGE_JAPANESE] =
        {
            {0x379, 0x08, 0},
            {0x379, 0x09, 0},
            {0x379, 0x0a, 0},
        },
    [LANGUAGE_ENGLISH] =
        {
            {0x375, 0x08, 0},
            {0x375, 0x09, 0},
            {0x375, 0x0a, 0},
        },
    [LANGUAGE_GERMAN] =
        {
            {0x374, 0x08, 0},
            {0x374, 0x09, 0},
            {0x374, 0x0a, 0},
        },
    [LANGUAGE_FRENCH] =
        {
            {0x377, 0x08, 0},
            {0x377, 0x09, 0},
            {0x377, 0x0a, 0},
        },
    [LANGUAGE_SPANISH] =
        {
            {0x376, 0x08, 0},
            {0x376, 0x09, 0},
            {0x376, 0x0a, 0},
        },
    [LANGUAGE_ITALIAN] =
        {
            {0x378, 0x08, 0},
            {0x378, 0x09, 0},
            {0x378, 0x0a, 0},
        },
};

static const u8 sWorldMapUnusedData[] UNUSED = {
