#include "pause_area_map.h"
#include "bg.h"
#include "constants/languages.h"
#include "functions.h"
#include "kirby.h"
#include "palette.h"
#include "pause_fade.h"
#include "pause_help.h"
#include "pause_world_map.h"
#include "subgames.h"
#include "treasures.h"

enum AreaMapRoomType {
    AREAMAP_ROOM_NORMAL,
    AREAMAP_ROOM_BIG,
    AREAMAP_ROOM_STAR,
};

enum AreaMapVisibility {
    AREAMAP_UNVISITED,
    AREAMAP_NO_MAP,
    AREAMAP_FOUND_MAP
};

enum MapDisableUI {
    DISABLE_WORLDMAP_B,
    DISABLE_AREAMAP_A,
    DISABLE_AREAMAP_B,
    DISABLE_AREAMAP_L,
    DISABLE_AREAMAP_R,
    NUM_DISABLE_MAP_UI,
};

enum AreaMapRoomCompletion {
    AREAMAP_ROOM_UNVISITED,
    AREAMAP_ROOM_VISITED,
    AREAMAP_ROOM_COMPLETED,
    NUM_AREAMAP_ROOM_COMPLETION,
};

enum AreaMapRoomInfoOffsets {
    AREAMAP_ROOMINFO_OFFSET_TUTORIAL = 0x0,
    AREAMAP_ROOMINFO_OFFSET_RAINBOW_ROUTE = 0x0,
    AREAMAP_ROOMINFO_OFFSET_MOONLIGHT_MANSION = 0x33,
    AREAMAP_ROOMINFO_OFFSET_CABBAGE_CAVERN = 0x4d,
    AREAMAP_ROOMINFO_OFFSET_MUSTARD_MOUNTAIN = 0x62,
    AREAMAP_ROOMINFO_OFFSET_CARROT_CASTLE = 0x7b,
    AREAMAP_ROOMINFO_OFFSET_OLIVE_OCEAN = 0x92,
    AREAMAP_ROOMINFO_OFFSET_PEPPERMINT_PALACE = 0xaf,
    AREAMAP_ROOMINFO_OFFSET_RADISH_RUINS = 0xce,
    AREAMAP_ROOMINFO_OFFSET_CANDY_CONSTELLATION = 0xeb,
    AREAMAP_ROOMINFO_OFFSET_DIMENSION_MIRROR = 0x107,
    NUM_AREAMAP_ROOMINFO_OFFSETS = 0x107,
};

struct AreaMapArrow {
    /* 0x00 */ struct Sprite sprite;
    /* 0x28 */ u16 unk28;  // Q_12_4 possible
    /* 0x2A */ u16 unk2A;  // Q_12_4 possible
    /* 0x2C */ u16 unk2C;
    /* 0x2E */ u16 unk2E;
}; /* size = 0x30 */

struct AreaMapSprite {
    /* 0x00 */ struct Sprite sprite;
    /* 0x28 */ u8 areaId;  // According to enum AreaId
    /* 0x29 */ u8 filler29;
    /* 0x2A */ u16 filler2A;
    /* 0x2C */ s32 globalX;
    /* 0x30 */ s32 globalY;
}; /* size = 0x34 */

struct AreaMapCamera {
    /* 0x00 */ u16 unk0;
    /* 0x02 */ u16 unk2;
    /* 0x04 */ u16 zoomEffective;
    /* 0x06 */ u8 areaId;  // According to enum AreaId
    /* 0x07 */ s8 doZoom;  // 1: zoom in, -1: zoom out, 0: zoom finished
    /* 0x08 */ s32 x;
    /* 0x0C */ s32 y;
    /* 0x10 */ u16 flags;              // bit0: doScroll
    /* 0x12 */ u16 zoomUnlockedAreas;  // Zoom in areas where the map has already been found
}; /* size = 0x14 */

struct PACKED AreaMapPalettePulseHeader {
    /* 0x00 */ u16 paletteOffset;  // in bytes
    /* 0x02 */ u16 stateSize;
    /* 0x04 */ u16 stateCount;
}; /* size = 0x6 */

struct AreaMapPalettePulse {
    /* 0x00 */ struct AreaMapPalettePulseHeader header;
    /* 0x08 */ const u8* states;
    /* 0x0C */ u16 stateIdx;
    /* 0x0E */ s16 waitCounter;
}; /* size = 0x10 */

/*
 * Both struct AreaMapPalettePulseStateRoom and struct AreaMapPalettePulseStatePath share the same semantics:
 * timer indicates the time to wait before the next palette swap shall occur.
 * colors are palette entries to be loaded according to the header.
 */
struct PACKED AreaMapPalettePulseStateRoom {
    /* 0x00 */ u16 timer;
    /* 0x02 */ u16 colors[5];
}; /* size = 0xC */

struct PACKED AreaMapPalettePulseStatePath {
    /* 0x00 */ u16 timer;
    /* 0x02 */ u16 colors[4];
}; /* size = 0xA */

struct AreaMapPalettePulseStates {
    /* 0x00 */ struct AreaMapPalettePulseHeader roomHeader;
    /* 0x06 */ struct AreaMapPalettePulseStateRoom roomStates[8];
    /* 0x66 */ struct AreaMapPalettePulseHeader pathHeader;
    /* 0x6C */ struct AreaMapPalettePulseStatePath pathStates[12];
}; /* size = 0xE4 */

struct AreaMapRoomInfo {
    /* 0x00 */ u16 roomId;
    /* 0x02 */ u8 areaId;  // According to enum AreaId
    /* 0x03 */ u8 type;    // According to enum AreaMapRoomType
    /* 0x04 */ u8 tileStartColumn;
    /* 0x05 */ u8 tileStartRow;
}; /* size = 0x8 */

struct AreaMap {
    /* 0x000 */ struct Background areaBg;
    /* 0x040 */ u32 arrowPulseCounter;
    /* 0x044 */ u16 nextAreaMapCounter;
    /* 0x046 */ s8 toGameCounter;
    /* 0x047 */ s8 gotoNextAreaMap;               // 1: Right/Ascend, -1: Left/Descend, 0: Stay
    /* 0x048 */ s8 visibility[NUM_AREA_IDS - 1];  // According to enum AreaMapVisibility
    /* 0x052 */ u8 filler52[0x6];
    /* 0x058 */ enum PauseMenuId nextMenuId;
    /* 0x05C */ s16 shardRotationIdx;
    /* 0x05E */ s16 shardRotation;
    /* 0x060 */ struct AreaMapArrow arrows[4];
    /* 0x120 */ struct AreaMapSprite kirbySprites[4];
    /* 0x1F0 */ struct AreaMapSprite abilityAccessories[4];
    /* 0x2C0 */ struct AreaMapSprite textLabels[0x14];
    /* 0x6D0 */ const struct AreaMapRoomInfo* roomInfos[4];
    /* 0x6E0 */ struct AreaMapCamera cameraBg2;
    /* 0x6F4 */ struct AreaMapPalettePulse palettePulse[2];
}; /* size = 0x714 */

struct Unk_08361A7C {
    /* 0x00 */ u8 filler0;
    /* 0x01 */ u8 filler1;
    /* 0x02 */ u8 filler2;
    /* 0x03 */ u8 unk3;
    /* 0x04 */ s32 unk4;
    /* 0x08 */ s32 unk8;
}; /* size = 0xC */

extern const u16 gAreaMapRoomsPalette[2][0x40];
extern const u32 gAreaMapRoomsTileset[0x1000];
extern const u32 gAreaMapRoomsTilemapOffsets[NUM_AREA_IDS];

/*
 * Every tilemap for each area (as accessed by adding `gAreaMapRoomsTilemapOffsets` and RL-decompressing from there)
 * holds entries for paths and rooms as if all were unvisited.
 * These entries are then later overriden in AreaMapRoomsOverwriteTilemap().
 */
extern const u8 gAreaMapRoomsTilemaps[] ALIGNED(4);

static const u16 sAreaMapPalettePulseOffsets[] = {
    offsetof(struct AreaMapPalettePulseStates, roomHeader) / sizeof(u16),
    offsetof(struct AreaMapPalettePulseStates, pathHeader) / sizeof(u16),
};

/*
 * Headers are copied into `AreaMapPalettePulse::header`, states are pointed to by `AreaMapPalettePulse::states`.
 * It's expected that the state structs always consist of u16 entries.
 */
static const struct AreaMapPalettePulseStates sAreaMapPalettePulseStates =
    {
